2011.01.15/spec and factory for profile model by titas norkunas/matcher/app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(params[:profile])
    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("name", "number", "sex", "profile_id", "created_at", "updated_at") VALUES ('Judita', 444, 'f', NULL, '2010-11-27 09:26:28.819064', '2010-11-27 09:26:28.819064')